Revit 2026 API

# TransformBasisY Property

---

The basis of the Y axis of this transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ BasisY { get; set; }
```
```vb
Public Property BasisY As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ BasisY {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member BasisY : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when the transform is internally marked as read-only. |

The Y axis of the old coordinate system in the new coordinate system, or the 2nd column of the conventional 3x4 matrix representation.

#### Reference

Transform Class

Autodesk.Revit.DB Namespace